var errcode = {
        0: 'success',

        //访问相关
        40001: '访问的模块不存在',
        40002: '访问的方法不存在',
        40003: '请求方式错误',

        //数据相关
        40100: '暂无数据',
        40101: '添加失败',
        40102: '更新失败',
        40103: '删除失败',
        40104: '参数错误',

        //权限相关
        40200: '用户名错误',
        40201: '密码错误',
        40202: '用户已存在',
        40203: '无效的客户端',
        40204: '无效的验证码',
        40205: '需要登录',
        40206: '登录已过期',
        40207: '用户名或密码错误',
        40208: '注册失败',
        40209: '需要实名认证',
        40210: '对不起，您没有权限进行此操作',
        40211: '账号在其他地方登陆',
        40212: '该账号不存在',
        40213: '帐号已存在',

        //文件相关
        40300: '上传失败'


    }

//文件相关
//     'file_not_exist'    => ['code' => '40300',  'msg' => '文件不存在'],